<?php
echo "<br> 8 ball load ".__FILE__;
           if (preg_match_all("/(?<![\w\d])(8ball [а-я]+)(?![\w\d])/uim",$message_preg, $mathes)) {
                $answers = ["Да","Нет","Не знаю","Мне похуй","чего пристал?","наверное","Бесспорно","Предрешено","Никаких сомнений","Определённо да","Можешь быть уверен в этом","Мне кажется — «да»","Вероятнее всего","Хорошие перспективы","Знаки говорят — «да»","Пока не ясно, попробуй снова","Спроси позже","Лучше не рассказывать","Сейчас нельзя предсказать","Сконцентрируйся и спроси опять","Даже не думай","Мой ответ — «нет»","По моим данным — «нет»","Перспективы не очень хорошие","Весьма сомнительно"];
                $rand = array_rand($answers);
sendMessage($chat_id,"Твой ответ: {$answers[$rand]}",$msgid);
             }

?>
